# Отсортировать массив
# [12, 4, 54, 29, 46, 36, 72, 99, 85] 
# Вывести итог на экран

Massiv = [12, 4, 54, 29, 46, 36, 72, 99, 85]

i, j = (0,0)

DlinaMassiva = len (Massiv)

print ('Dlina massiva :', DlinaMassiva)
